        identification          division.
        program-id.             a-------------------------------------------------------------b.
        procedure               division.
        C-------------------------------------------------------------D section.
        0-------------------------------------------------------------1.
        display "Whatta world".
        end program             a-------------------------------------------------------------b.

