       IDENTIFICATION DIVISION.
       PROGRAM-ID. prog.
       PROCEDURE DIVISION.
           DISPLAY "Gratuitous Display."
           END-DISPLAY.
           EXIT PROGRAM.
           END PROGRAM prog.
