        identification division.
        program-id. prog.
        data division.
        working-storage section.
        01 var1 pic x(32).
        procedure division.
        display var1.
