        IDENTIFICATION DIVISION.
        PROGRAM-ID. TEST.
        ENVIRONMENT DIVISION.
        INPUT-OUTPUT SECTION.
        FILE-CONTROL.
           SELECT SEQDEFAULT  ASSIGN TO 'SEQDEFAULT.rpt'
             ORGANIZATION IS SEQUENTIAL.
           SELECT SEQAFTER    ASSIGN TO 'SEQAFTER.rpt'
             ORGANIZATION IS SEQUENTIAL.
           SELECT SEQBEFORE   ASSIGN TO 'SEQBEFORE.rpt'
             ORGANIZATION IS SEQUENTIAL.

           SELECT LSEQDEFAULT ASSIGN TO 'LSEQDEFAULT.rpt'
             ORGANIZATION IS LINE SEQUENTIAL.
           SELECT LSEQAFTER   ASSIGN TO 'LSEQAFTER.rpt'
             ORGANIZATION IS LINE SEQUENTIAL.
           SELECT LSEQBEFORE  ASSIGN TO 'LSEQBEFORE.rpt'
             ORGANIZATION IS LINE SEQUENTIAL.

        DATA DIVISION.
        FILE SECTION.
        FD  SEQDEFAULT.
            01  SEQDEFAULT-REC PIC X(16).
        FD  SEQAFTER.
            01  SEQAFTER-REC PIC X(16).
        FD  SEQBEFORE.
            01  SEQBEFORE-REC PIC X(16).

        FD  LSEQDEFAULT.
            01  LSEQDEFAULT-REC PIC X(16).
        FD  LSEQAFTER.
            01  LSEQAFTER-REC PIC X(16).
        FD  LSEQBEFORE.
            01  LSEQBEFORE-REC PIC X(16).

        WORKING-STORAGE SECTION.
            01  EOL-COUNT PIC 9 VALUE 1.

            01  PRINTREC PIC X(16).

        PROCEDURE DIVISION.
            OPEN OUTPUT SEQDEFAULT
            MOVE "1" TO PRINTREC
                WRITE SEQDEFAULT-REC FROM PRINTREC
            MOVE "22" TO PRINTREC
                WRITE SEQDEFAULT-REC FROM PRINTREC
            MOVE "333" TO PRINTREC
                WRITE SEQDEFAULT-REC FROM PRINTREC
            CLOSE SEQDEFAULT

            OPEN OUTPUT SEQAFTER
            MOVE "1" TO PRINTREC
                WRITE SEQAFTER-REC FROM PRINTREC
                AFTER ADVANCING EOL-COUNT LINE
            MOVE "22" TO PRINTREC
                WRITE SEQAFTER-REC FROM PRINTREC
                AFTER ADVANCING EOL-COUNT LINE
            MOVE "333" TO PRINTREC
                WRITE SEQAFTER-REC FROM PRINTREC
                AFTER ADVANCING EOL-COUNT LINE
            CLOSE SEQAFTER

            OPEN OUTPUT SEQBEFORE
            MOVE "1" TO PRINTREC
                WRITE SEQBEFORE-REC FROM PRINTREC
                BEFORE ADVANCING EOL-COUNT LINE
            MOVE "22" TO PRINTREC
                WRITE SEQBEFORE-REC FROM PRINTREC
                BEFORE ADVANCING EOL-COUNT LINE
            MOVE "333" TO PRINTREC
                WRITE SEQBEFORE-REC FROM PRINTREC
                BEFORE ADVANCING EOL-COUNT LINE
            CLOSE SEQBEFORE

            OPEN OUTPUT LSEQDEFAULT
            MOVE "1" TO PRINTREC
                WRITE LSEQDEFAULT-REC FROM PRINTREC
            MOVE "22" TO PRINTREC
                WRITE LSEQDEFAULT-REC FROM PRINTREC
            MOVE "333" TO PRINTREC
                WRITE LSEQDEFAULT-REC FROM PRINTREC
            CLOSE LSEQDEFAULT

            OPEN OUTPUT LSEQAFTER
            MOVE "1" TO PRINTREC
                WRITE LSEQAFTER-REC FROM PRINTREC
                AFTER ADVANCING EOL-COUNT LINE
            MOVE "22" TO PRINTREC
                WRITE LSEQAFTER-REC FROM PRINTREC
                AFTER ADVANCING PAGE
            MOVE "333" TO PRINTREC
                WRITE LSEQAFTER-REC FROM PRINTREC
                AFTER ADVANCING EOL-COUNT LINE
            CLOSE LSEQAFTER

            OPEN OUTPUT LSEQBEFORE
            MOVE "1" TO PRINTREC
                WRITE LSEQBEFORE-REC FROM PRINTREC
                BEFORE ADVANCING EOL-COUNT LINE
            MOVE "22" TO PRINTREC
                WRITE LSEQBEFORE-REC FROM PRINTREC
                BEFORE ADVANCING PAGE
            MOVE "333" TO PRINTREC
                WRITE LSEQBEFORE-REC FROM PRINTREC
                BEFORE ADVANCING EOL-COUNT LINE
            CLOSE LSEQBEFORE

            STOP RUN.
